* Tidyverse sceptic - comparing Base-R and the "Tidyverse"

  [[https://github.com/matloff/TidyverseSkeptic#using-tidy-hinders-the-learning-process--case-studies][Source: case studies]]

** Summary on Tidyverse Sceptic essay

   * Issues with abstraction (FP), cognitive overload (functions),
     dumbing down (vectors), attitude (compliance)

*** New R packages / functions commands / concepts
**** ~broom~ package
**** right assignment operator ~->~

**** ~tapply~    

   * Perhaps new to you: ~->~ operator, ~tapply~, ~aggregate~

   * ~tapply~ is from the ~apply~ family of functions. Matloff is right,
     ~aggregate~ really is quite a bit more complicated.

     #+name: tapply
     #+begin_src R :exports both :session :results output
       ##       library(dplyr)
       group_by(airquality, Month) %>%
	 summarize(o3 = mean(Ozone, na.rm = TRUE))

       ## aggregate(airquality[, “Ozone”],
       ##           list(Month = airquality[, “Month”]),
       ##           mean, na.rm = TRUE)

       tapply(airquality$Ozone,   ## what to split
	      airquality$Month,   ## how to split it
	      function(x) mean(x,na.rm=T))  ## what to apply to the result
     #+end_src
     
     #+RESULTS: tapply
     #+begin_example
     # A tibble: 5 x 2
       Month    o3
       <
     <dbl>
     1     5  23.6
     2     6  29.4
     3     7  59.1
     4     8  60.0
     5     9  31.4
            5        6        7        8        9
     23.61538 29.44444 59.11538 59.96154 31.44828
     #+end_example

   * ~dplyr~ equivalent functions

     ~dplyr::group_by~ selects 

   * Combining both methodologies!

   #+begin_src R :exports both :session :results silent
     library(dplyr)

     mtcars$gear_char <-
       case_when(
         mtcars$gear == 3 ~ 'three',
         mtcars$gear == 4 ~ 'four',
         mtcars$gear == 5 ~ 'five')
   #+end_src

   * https://github.com/matloff/TidyverseSkeptic#case-study--tidy-as-an-obstacle-to-r-statistical-methods
** Project idea: rewrite any of the gapminder notebooks in base-R.

